podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/UART_LPC13xx.svd.xml
<!--
Devices using this peripheral: 
      LPC13xx
-->
      <peripheral>
         <?sourceFile "UART_LPC13xx" ?>
         <name>UART</name>
         <description>UART</description>
         <groupName>UART</groupName>
         <headerStructName>UART</headerStructName>
         <baseAddress>0x40008000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x28</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4C</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DLL</name>
               <description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. When DLAB=1</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DLLSB</name>
                     <description>The UART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the UART</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RBR</name>
               <description>Receiver Buffer Register. Contains the next received character to be read. When DLAB=0</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>RBR</name>
                     <description>The UART Receiver Buffer Register contains the oldest received byte in the UART RX FIFO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>THR</name>
               <description>Transmit Holding Register. The next character to be transmitted is written here. When DLAB=0</description>
               <addressOffset>0x0</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>THR</name>
                     <description>Writing to the UART Transmit Holding Register causes the data to be stored in the UART transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DLM</name>
               <description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. When DLAB=1</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>DLMSB</name>
                     <description>The UART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the UART</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts. When DLAB=0</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>RBRIE</name>
                     <description>Interrupt Enable. Enables the Receive Data Available interrupt for UART. It also controls the Character Receive Time-out interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable the RDA interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable the RDA interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>THREIE</name>
                     <description>Interrupt Enable. Enables the THRE interrupt for UART. The status of this interrupt can be read from LSR[5]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable the THRE interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable the THRE interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXLIE</name>
                     <description>Line Interrupt Enable. Enables the UART RX line status interrupts. The status of this interrupt can be read from LSR[4:1]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable the RX line status
interrupts</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable
the RX line status interrupts</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABEOINTEN</name>
                     <description>Enables the end of auto-baud interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable end of auto-baud
Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable
end of auto-baud Interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABTOINTEN</name>
                     <description>Enables the auto-baud time-out interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable auto-baud time-out
Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable
auto-baud time-out Interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCR</name>
               <description>FIFO Control Register. Controls UART FIFO usage and modes</description>
               <addressOffset>0x8</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFO Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>UART FIFOs are disabled. Must not be used in the application</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Active high enable for both UART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART operation. Any transition on this bit will automatically clear the UART FIFOs</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXFIFOR</name>
                     <description>RX FIFO Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOACTION</name>
                           <description>No impact on either of UART FIFOs</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR</name>
                           <description>Writing a logic 1 to FCR[1] will clear all bytes in UART Rx FIFO, reset the pointer logic. This bit is self-clearing</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFIFOR</name>
                     <description>TX FIFO Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOACTION</name>
                           <description>No impact on either of UART FIFOs</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR</name>
                           <description>Writing a logic 1 to FCR[2] will clear all bytes in UART TX FIFO, reset the pointer logic. This bit is self-clearing</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXTLVL</name>
                     <description>RX Trigger Level. These two bits determine how many receiver UART FIFO characters must be written before an interrupt is activated</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>TRIGGER_LEVEL_0_1_C</name>
                           <description>Trigger level 0 (1 character or 0x01)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIGGER_LEVEL_1_4_C</name>
                           <description>Trigger level 1 (4 characters or 0x04)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIGGER_LEVEL_2_8_C</name>
                           <description>Trigger level 2 (8 characters or 0x08)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIGGER_LEVEL_3_14_</name>
                           <description>Trigger level 3 (14 characters or 0x0E)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IIR</name>
               <description>Interrupt ID Register. Identifies which interrupt(s) are pending</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>INTSTATUS</name>
                     <description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INT</name>
                           <description>At least one interrupt
is pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOINT</name>
                           <description>No
interrupt is pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INTID</name>
                     <description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART Rx FIFO. All other combinations of IER[3:1] not listed below are reserved (100,101,111)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RECEIVE</name>
                           <description>1   - Receive Line Status
(RLS)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RDA</name>
                           <description>2a
- Receive Data Available (RDA)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTIMEOUT</name>
                           <description>2b - Character Time-out Indicator
(CTI)</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THRE</name>
                           <description>3
  - THRE Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODEM</name>
                           <description>4   - Modem interrupt</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIFOEN</name>
                     <description>These bits are equivalent to FCR[0]</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ABEOINT</name>
                     <description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABTOINT</name>
                     <description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
