podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/UART_LPC13xx.svd.xml
            <register>
               <name>MSR</name>
               <description>Modem status register</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DELTACTS</name>
                     <description>Set upon state change of input CTS. Cleared on a MSR read</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_STATE_CHANGE</name>
                           <description>No change detected on modem input CTS</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STATE_CHANGE_DETECTE</name>
                           <description>State change detected on modem input CTS</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DELTADSR</name>
                     <description>Set upon state change of input DSR. Cleared on a MSR read</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_STATE_CHANGE</name>
                           <description>No change detected on modem input DSR</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STATE_CHANGE_DETECTE</name>
                           <description>State change detected on modem input DSR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TERI</name>
                     <description>Trailing Edge RI. Set upon low to high transition of input RI. Cleared on a MSR read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_STATE_CHANGE</name>
                           <description>No change detected on modem input, RI</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_TO_HIGH_TRANSITI</name>
                           <description>Low-to-high transition detected on RI</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DELTADCD</name>
                     <description>Set upon state change of input  DCD. Cleared on a MSR read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_STATE_CHANGE</name>
                           <description>No change detected on modem input DCD</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STATE_CHANGE_DETECTE</name>
                           <description>State change detected on modem input DCD</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>Clear To Send State. Complement of input signal CTS. This bit is connected to MCR[1] in modem loopback mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSR</name>
                     <description>Data Set Ready State. Complement of input signal DSR. This bit is connected to MCR[0] in modem loopback mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RI</name>
                     <description>Ring Indicator State. Complement of input RI. This bit is connected to MCR[2] in modem loopback mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCD</name>
                     <description>Data Carrier Detect State. Complement of input DCD. This bit is connected to MCR[3] in modem loopback mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <description>Scratch Pad Register. Eight-bit temporary storage for software</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>Pad</name>
                     <description>A readable, writable byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>Auto-baud Control Register. Contains controls for the auto-baud feature</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>START</name>
                     <description>This bit is automatically cleared after auto-baud completion</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>AUTO_BAUD_STOP_AUTO</name>
                           <description>Auto-baud stop (auto-baud is not running)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_BAUD_START_AUT</name>
                           <description>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Auto-baud mode select bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MODE_0_</name>
                           <description>Mode 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE_1_</name>
                           <description>Mode 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTORESTART</name>
                     <description>Auto restart</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_RESTART</name>
                           <description>No restart</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESTART_IN_CASE_OF_T</name>
                           <description>Restart in case of time-out (counter restarts at next UART Rx falling edge)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABEOINTCLR</name>
                     <description>End of auto-baud interrupt clear bit (write only accessible)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOACTION</name>
                           <description>Writing a 0 has no impact</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR</name>
                           <description>Writing a 1 will clear the corresponding interrupt in the IIR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ABEOINTCLR" > <name>ABTOINTCLR</name> <description>Auto-baud time-out interrupt clear bit (write only accessible)</description> <bitOffset>9</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FDR</name>
               <description>Fractional Divider Register. Generates a clock input for the baud rate divider</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x10</resetValue>
               <fields>
                  <field>
                     <name>DIVADDVAL</name>
                     <description>Baud rate generation pre-scaler divisor value. If this field is 0, fractional baud rate generator will not impact the UART baud rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MULVAL</name>
                     <description>Baud rate pre-scaler multiplier value. This field must be greater or equal 1 for UART to operate properly, regardless of whether the fractional baud rate generator is used or not</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TER</name>
               <description>Transmit Enable Register. Turns off UART transmitter for use with software flow control</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>TXEN</name>
                     <description>When this bit is 1, as it is after a Reset, data written to the THR is output on the TXD pin as soon as any preceding data has been sent. If this bit cleared to 0 while a character is being sent, the transmission of that character is completed, but no further characters are sent until this bit is set again. In other words, a 0 in this bit blocks the transfer of characters from the THR or TX FIFO into the transmit shift register. Software can clear this bit when it detects that the a hardware-handshaking TX-permit signal (CTS) has gone false, or with software handshaking, when it receives an XOFF character (DC3). Software can set this bit again when it detects that the TX-permit signal has gone true, or when it receives an XON (DC1) character</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RS485CTRL</name>
               <description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>NMMEN</name>
                     <description>NMM enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the UART to set the parity error and generate an interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The receiver is enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The receiver is disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AADEN</name>
                     <description>AAD enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Auto Address Detect (AAD) is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Auto Address Detect (AAD) is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEL</name>
                     <description>Direction control pins select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RTS</name>
                           <description>If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DTR</name>
                           <description>If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCTRL</name>
                     <description>Direction control enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_AUTO_DIRECTI</name>
                           <description>Disable Auto Direction Control</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_AUTO_DIRECTIO</name>
                           <description>Enable Auto Direction Control</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OINV</name>
                     <description>This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RS485ADRMATCH</name>
               <description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>ADRMATCH</name>
                     <description>Contains the address match value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RS485DLY</name>
               <description>RS-485/EIA-485 direction control delay</description>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>DLY</name>
                     <description>Contains the direction control (RTS or DTR) delay value. This register works in conjunction with an 8-bit counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
